"use client";
import { MovingSky } from "~/component/bg/MovingSky";
import { motion } from "framer-motion";
import Link from "next/link";

export default function Page() {
  return (
    <div className="overflow-hidden object-none">
      <MovingSky />
      <motion.div
        initial={{ opacity: 0 }}
        animate={{ opacity: 1 }}
        transition={{
          duration: 1,
          delay: 0.5,
        }}
        exit={{ opacity: 0, transition: { duration: 2 } }}
        className="flex min-h-screen flex-col"
      >
        <div className="absolute top-20 z-10 flex h-full w-full justify-center">
          <div className="flex h-3/4 w-[90%] flex-col items-start gap-5 overflow-x-scroll rounded-xl bg-white p-4 text-left text-sm text-black">
            <p className="font-bold">ข้อตกลงการเข้าร่วมแบบสอบถาม</p>
            <p>
              เรียนคณะกรรมการพิจารณาจริยธรรม Inform consent form
              ผู้เข้าร่วมวิจัยจะได้อ่านก่อนลงมือทำแบบสอบถามโดยจะปรากฏอยู่หน้าก่อนการเริ่มทำ
              แบบสอบถาม หากผู้วิจัยยินดีเข้าร่วมสามารถกดตกลงเพื่อเริ่มทำแบบสอบถามดังที่แนบได้ทันที
              (Consent by action)
            </p>
            <p>
              การศึกษาวิจัยความชุกและปัจจัยที่เกี่ยวข้องกับการเกิดภาวะหมดไฟในกลุ่มนักศึกษาแพทย์ในประเทศไทย
            </p>
            <div className="flex flex-col gap-1">
              <p className="underline">คำชี้แจง</p>
              <p>
                1. แบบสอบถามชุดนี้เป็นส่วนหนึ่งของการวิจัยเรื่อง
                “ความชุกและปัจจัยที่เกี่ยวข้องกับการเกิดภาวะหมดไฟในกลุ่มนักศึกษาแพทย์ในประเทศไทย”
                มีวัตถุประสงค์เพื่อหาความชุกของภาวะหมดไฟในการทำงานรวมถึงสืบค้นปัจจัยที่เกี่ยวข้องกับภาวะหมดไฟดังกล่าว
                โดยมีผู้วิจัยหลักคือ ผศ.นพ.วิทวัส สุรวัฒนสกุล
                ภาควิชาเวชศาสตร์ชุมชน คณะแพทยศาสตร์ มหาวิทยาลัยเชียงใหม่
                โดยมีแหล่งทุนสนับสนุน ในการทำวิจัย
              </p>
              <p>
                2. ท่านได้รับการเชื้อเชิญให้เข้าร่วมการศึกษาวิจัยนี้
                เนื่องจากท่านคือนิสิตนักศึกษาแพทย์ที่ศึกษาในประเทศไทย
                ท่านจะได้มีโอกาสและเวลาอ่านข้อมูลข้างล่างก่อน
                หากท่านมีข้อข้องใจใด ๆ เกี่ยวกับการศึกษาวิจัยนี้ และสิทธิต่าง ๆ
                กรุณาซักถามคณะผู้วิจัย หรือผู้ช่วยผู้วิจัยที่ทำการศึกษาวิจัย
                ซึ่งจะเป็นผู้สามารถให้ความกระจ่างได้
              </p>
              <p>
                3. หากท่านตัดสินใจเข้าร่วมการศึกษาวิจัย
                ท่านสามารถเริ่มทำแบบสอบถามได้ทันที โดยไม่ต้องลงนาม
                โดยท่านจะทำแบบสอบถามเป็นเวลา 10-15 นาที/ครั้ง จำนวน 1 ครั้ง
                หากมีคำถามที่ท่านไม่อยากตอบ ท่านสามารถข้ามคำถามดังกล่าวไปได้
                โดยตอบตามความเป็นจริง หรือตรงกับความรู้สึกของท่านมากที่สุด
                คำตอบของท่านจะถือเป็นความลับ{" "}
                <span className="underline">
                  ไม่ระบุตัวตนของผู้ตอบแบบสอบถาม
                </span>{" "}
                ผลที่ได้จากแบบสอบถามจะถูกนำเสนอในภาพรวมเท่านั้น
              </p>
              <p>
                4. โครงการวิจัยนี้เป็นการวิจัยความเสี่ยงต่ำ
                เนื่องจากแบบสอบถามไม่มีประเด็นคำถามที่เป็นประเด็นต่อความอ่อนไหว
              </p>
              <p>
                5. ท่านไม่จำเป็นต้องเข้าร่วมการศึกษาวิจัยนี้หากไม่สมัครใจ
                หลังจากตัดสินใจจะเข้าร่วมการศึกษาแล้ว
                ท่านสามารถจะถอนตัวได้ตลอดเวลา การตัดสินใจของท่าน
                โดยท่านจะไม่เสียสิทธิ์ใด ๆ ทั้งสิ้น
              </p>
              <p>
                6. ท่านจะไม่ได้รับประโยชน์โดยตรงจากการเข้าร่วมงานวิจัยในครั้งนี้
                แต่ผลสรุปการศึกษาจะเป็นประโยชน์ต่อวงวิชาการเพื่อเป็นองค์ความรู้ต่อสาธารณะต่อไป
              </p>
              <p>
                7. ข้อมูลของท่าน ที่ถูกบันทึกไว้ระหว่างการศึกษา หรือข้อมูลอื่น ๆ
                จะถูกเก็บไว้เป็นความลับตลอดเวลา คณะกรรมการจริยธรรมการวิจัย
                สามารถที่จะขอตรวจสอบข้อมูลเหล่านี้ได้
                โดยข้อมูลเหล่านี้จะยังเก็บรักษาไว้เป็นเรื่องลับเฉพาะ
                โดยมีเฉพาะคณะผู้วิจัยเท่านั้นที่ทราบข้อมูลของท่าน
                โดยจะเก็บข้อมูลของท่านไว้ที่โปรแกรมเก็บข้อมูล Redcap
                และจะเก็บข้อมูลไว้เป็นเวลา 2 ปีแล้วลบข้อมูลดังกล่าวทิ้ง
                ท่านสามารถขอดำเนินการลบข้อมูลตนเองออกจากระบบได้ตลอดเวลา
                โดยการแจ้งหัวหน้าโครงการโดยตรง ดังหมายเลขโทรศัพท์ท้ายเอกสารนี้
              </p>
              <p>
                8.
                ข้อมูลส่วนตัวที่ท่านไม่ต้องการเปิดเผยจะถูกเก็บรวบรวมไว้และนำมาใช้เพื่อวัตถุประสงค์ทางการวิจัยทางการแพทย์เฉพาะในส่วนที่เกี่ยวข้องกับการศึกษาเท่านั้น
                โดยจะไม่มีการอ้างถึงชื่อของท่าน ในรายงานหรือวารสารใด ๆ
                โดยผู้วิจัยจะทำทุกวิถีทางเพื่อให้เกิดความมั่นใจว่าข้อมูลส่วนตัวของท่าน
                จะถูกปกป้องไว้
              </p>
              <p>
                9. ในการเข้าศึกษาวิจัยครั้งนี้
                ไม่มีค่าใช้จ่ายในการเข้าร่วมการศึกษาวิจัย
                และมีค่าตอบแทนให้แก่ผู้ตอบแบบสอบถาม จำนวน 50 บาท
                สำหรับผู้ที่ยินยอม โดยจะโอนเข้าบัญชีธนาคาร หรือเบอร์โทรพร้อมเพย์
                ภายใน 30 วันหลังจากทีมผู้วิจัยได้รับข้อมูล
              </p>
              <p>
                10. หากท่าน มีคำถามหรือข้อสงสัย กรุณาติดต่อ ผศ.นพ.วิทวัส
                สุรวัฒนสกุล เบอร์โทรศัพท์ 053-935472-4 (ในเวลาราชการ)
                โทรศัพท์มือถือ 098-8249200 (นอกเวลาราชการ)
                หรือติดต่อสอบถามเกี่ยวกับสิทธิในการเป็นอาสาสมัครในโครงการวิจัย
                ได้ที่ สำนักงานจริยธรรมการวิจัย คณะแพทยศาสตร์
                มหาวิทยาลัยเชียงใหม่ 110 ถ.อินทวโรรส ต.ศรีภูมิ อ.เมือง
                จ.เชียงใหม่ 50200 โทรศัพท์ /โทรสาร 053-946643 (ในเวลาราชการ)
              </p>
            </div>
            <div className="flex flex-col gap-1">
              <p>แบบสอบถามนี้ ประกอบด้วยคำถาม 6 ส่วน รวม 79 ข้อ ประกอบด้วย</p>
              <p>
                ส่วนที่ 1 ข้อมูลทั่วไป จำนวน{" "}
                <span className="font-bold">8</span> ข้อ
              </p>
              <p>
                ส่วนที่ 2 ข้อมูลการศึกษา จำนวน{" "}
                <span className="font-bold">4</span> ข้อ
              </p>
              <p>
                ส่วนที่ 3 แบบประเมินภาวะหมดไฟ:Copenhagen Burnout Inventory
                Adapted for Students : CBI-SS จำนวน{" "}
                <span className="font-bold">25</span> ข้อ
              </p>
              <p>
                ส่วนที่ 4 แบบประเมินภาวะยืดหยุ่นทางอารมณ์ : Resilience Inventory
                (RI-9) จำนวน <span className="font-bold">9</span> ข้อ
              </p>
              <p>
                ส่วนที่ 5 แบบประเมินภาวะสุขภาพจิต : Depression Anxiety Stress
                Scale (DASS-21) จำนวน <span className="font-bold">21</span> ข้อ
              </p>
              <p>
                ส่วนที่ 6
                แบบประเมินสภาพแวดล้อมทางการศึกษาในสถาบันการศึกษาด้านวิชาชีพด้านสุขภาพ
                : The Dundee Ready Education Environment Measure - 12 items
                (DREEM-12) จำนวน <span className="font-bold">12</span> ข้อ
              </p>
            </div>
            <p className="font-bold">
              หากท่านอ่านและเข้าใจรายละเอียดด้านบนครบถ้วน
              ท่านสามารถเริ่มทำแบบสอบถามได้ทันที โดยไม่ต้องลงนาม
            </p>
          </div>
        </div>
        <Link href="/1-4_1">
          <div className="absolute bottom-[8%] flex w-full justify-center">
            <button className="z-20 h-8 w-28 rounded-2xl bg-white text-lg text-black shadow-sm">
              รับทราบ
            </button>
          </div>
        </Link>
      </motion.div>
    </div>
  );
}
